/* No comment provided by engineer. */
"Set Cyberduck as default application for FTP and SFTP locations?" = "Aseta Cyberduck oletusohjelmaksi FTP- ja SFTP-linkeille?";

/* No comment provided by engineer. */
"As the default application, Cyberduck will open when you click on FTP or SFTP links in other applications, such as your web browser. You can change this setting in the Preferences later." = "Oletusohjelmana Cyberduck avautuu kun kaksoisosoitat FTP- tai SFTP-linkkejä muissa ohjelmsssa kuten web-selaimessasi. Voit vaihtaa tämän asetuksen Asetuksista myöhemmin.";

/* Apply proposed action. */
"Change" = "Vaihda";

/* Do not display this dialog again. */
"Don't ask again" = "Älä kysy uudelleen";

/* Don't change anything. */
"Cancel" = "Kumoa";

/* Bookmark import from thirdparty applications */ 
"Import" = "Tuo";
/* Import <<Application Name>> Bookmarks */
"Import {0} Bookmarks" = "Tuo {0} kirjanmerkkiä";
/* 23 bookmarks found. */
"{0} bookmarks found. Do you want to add these to your bookmarks?" = "Löydetty {0} kirjanmerkkiä. Haluatko lisätä nämä kirjanmerkkeihisi?";
/* Write the source application into the comment field of the imported bookmark */
"Imported from {0}" = "Tuotu ohjelmasta {0}";